[
  {
    "image": "https://i.ibb.co.com/0vfhc8S/image.png",
    "title": "Snapify",
    "companyName": "PixelCraft Studios",
    "id": 1,
    "description": "Snapify is your ultimate photo editing companion that brings professional-grade tools to your fingertips. With powerful AI-driven filters, instant background removal, and intelligent lighting adjustments, you can transform ordinary photos into stunning masterpieces in seconds. Snapify also offers beauty retouching, creative overlays, and one-tap color correction for quick perfection. Whether you're creating social media content or professional portraits, Snapify makes editing effortless, fun, and beautifully precise — all with an intuitive interface designed for everyone, from beginners to photography enthusiasts. Capture, edit, and share like a pro with Snapify!",
    "size": 125,
    "reviews": 48213,
    "ratingAvg": 4.5,
    "downloads": "1.2M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2300
      },
      {
        "name": "2 star",
        "count": 1800
      },
      {
        "name": "3 star",
        "count": 4600
      },
      {
        "name": "4 star",
        "count": 10200
      },
      {
        "name": "5 star",
        "count": 29313
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0VsdVqnx/image.png",
    "title": "TaskFlow",
    "companyName": "NeuroSoft Labs",
    "id": 2,
    "description": "TaskFlow helps you stay productive and organized like never before. Easily create to-do lists, manage deadlines, and track your daily progress with smart reminders and insightful productivity reports. Its AI-based task suggestions adapt to your habits, helping you focus on what truly matters. Whether you’re managing personal goals, team projects, or study schedules, TaskFlow’s clean interface and cloud synchronization make your workflow seamless across all devices. Boost efficiency, eliminate procrastination, and stay in control with a task manager that truly understands you. Simplify your day — one smart task at a time.",
    "size": 89,
    "reviews": 21045,
    "ratingAvg": 4.2,
    "downloads": "850K",
    "ratings": [
      {
        "name": "1 star",
        "count": 1100
      },
      {
        "name": "2 star",
        "count": 1400
      },
      {
        "name": "3 star",
        "count": 3000
      },
      {
        "name": "4 star",
        "count": 6700
      },
      {
        "name": "5 star",
        "count": 10745
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KzfXZt5s/image.png",
    "title": "FitPulse",
    "companyName": "ActiveLife Inc.",
    "id": 3,
    "description": "FitPulse is your personal fitness partner that helps you reach your goals with precision and motivation. Create customized workout plans, monitor calories, track your steps, and view detailed progress charts all in one place. With AI-driven coaching, smart reminders, and heart-rate insights, FitPulse makes every move count. Whether you’re losing weight, building muscle, or maintaining wellness, the app adjusts to your pace and needs. Stay inspired with daily challenges, expert tips, and community motivation. FitPulse doesn’t just track your fitness — it transforms your lifestyle for lasting results.",
    "size": 150,
    "reviews": 39762,
    "ratingAvg": 4.7,
    "downloads": "2.2M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1900
      },
      {
        "name": "2 star",
        "count": 2300
      },
      {
        "name": "3 star",
        "count": 3500
      },
      {
        "name": "4 star",
        "count": 8900
      },
      {
        "name": "5 star",
        "count": 23162
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/prdxdZPD/image.png",
    "title": "NoteNest",
    "companyName": "BlueBay Technologies",
    "id": 4,
    "description": "NoteNest turns your ideas into organized brilliance. Capture quick notes, create checklists, and record thoughts effortlessly with AI-powered tagging and voice input. Notes sync securely across all your devices, ensuring your information is always at your fingertips. With rich formatting, search filters, and color-coded organization, finding what you need has never been easier. Perfect for students, professionals, and creatives alike, NoteNest simplifies your workflow and keeps your mind clutter-free. Whether you’re jotting a reminder or planning a project, NoteNest makes every idea matter.",
    "size": 72,
    "reviews": 15520,
    "ratingAvg": 4.0,
    "downloads": "600K",
    "ratings": [
      {
        "name": "1 star",
        "count": 900
      },
      {
        "name": "2 star",
        "count": 1200
      },
      {
        "name": "3 star",
        "count": 2600
      },
      {
        "name": "4 star",
        "count": 4800
      },
      {
        "name": "5 star",
        "count": 6020
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/LzknmKH8/image.png",
    "title": "TravelMate",
    "companyName": "GlobeGo",
    "id": 5,
    "description": "TravelMate is your ultimate travel planner and discovery companion. Explore breathtaking destinations, plan trips effortlessly, and receive personalized itineraries tailored to your interests. Find top attractions, book hotels and flights, and access insider tips for a seamless journey. With offline access, travel budgets, and smart maps, TravelMate ensures stress-free adventures anywhere you go. Whether you’re a solo traveler, a couple, or a family, TravelMate brings the world closer to you. Make every journey unforgettable with AI-powered recommendations and a truly immersive travel experience.",
    "size": 140,
    "reviews": 34500,
    "ratingAvg": 4.6,
    "downloads": "1.7M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1600
      },
      {
        "name": "2 star",
        "count": 1900
      },
      {
        "name": "3 star",
        "count": 4200
      },
      {
        "name": "4 star",
        "count": 7600
      },
      {
        "name": "5 star",
        "count": 19100
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0yTzqzJY/image.png",
    "title": "SoundWave",
    "companyName": "EchoVerse",
    "id": 6,
    "description": "SoundWave redefines your music experience with high-fidelity audio streaming and intelligent playlist curation. Discover millions of songs, trending podcasts, and exclusive releases personalized to your taste. With smart recommendations, offline playback, and cross-device syncing, your favorite sounds are always within reach. SoundWave also features mood-based mixes, custom equalizers, and social sharing tools so you can vibe with friends anytime. Whether you’re relaxing, working, or working out, SoundWave tunes every moment perfectly. Dive into pure sound — powered by AI, inspired by you.",
    "size": 210,
    "reviews": 58912,
    "ratingAvg": 4.3,
    "downloads": "3M",
    "ratings": [
      {
        "name": "1 star",
        "count": 2800
      },
      {
        "name": "2 star",
        "count": 3100
      },
      {
        "name": "3 star",
        "count": 7500
      },
      {
        "name": "4 star",
        "count": 14500
      },
      {
        "name": "5 star",
        "count": 30912
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/CpK8sCM9/image.png",
    "title": "EduSpark",
    "companyName": "MindBridge Learning",
    "id": 7,
    "description": "EduSpark transforms the way you learn with interactive lessons, engaging videos, and personalized progress tracking. Explore a vast library of subjects designed by top educators and practice with adaptive quizzes that help you master every concept. Whether you’re preparing for exams or learning new skills, EduSpark keeps your motivation high with achievements and streak rewards. With AI-driven insights and offline access, education becomes accessible anytime, anywhere. EduSpark makes learning smarter, faster, and more enjoyable for students of all ages.",
    "size": 165,
    "reviews": 27890,
    "ratingAvg": 4.4,
    "downloads": "950K",
    "ratings": [
      {
        "name": "1 star",
        "count": 1500
      },
      {
        "name": "2 star",
        "count": 1700
      },
      {
        "name": "3 star",
        "count": 3400
      },
      {
        "name": "4 star",
        "count": 6200
      },
      {
        "name": "5 star",
        "count": 15090
      }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mVgTNPfX/image.png",
    "title": "ShopSmart",
    "companyName": "NextCart Ltd.",
    "id": 8,
    "description": "ShopSmart helps you shop smarter and save more with powerful price-comparison tools and real-time deals. Browse thousands of online stores, track discounts, and get instant alerts when your favorite products drop in price. The app also analyzes trends to recommend the best time to buy. Whether you’re hunting gadgets, fashion, or groceries, ShopSmart ensures you get the best value for your money. With wishlist tracking, coupons, and cashback offers, shopping online has never been this rewarding.",
    "size": 98,
    "reviews": 19230,
    "ratingAvg": 4.1,
    "downloads": "720K",
    "ratings": [
      {
        "name": "1 star",
        "count": 1200
      },
      {
        "name": "2 star",
        "count": 1400
      },
      {
        "name": "3 star",
        "count": 3100
      },
      {
        "name": "4 star",
        "count": 5200
      },
      {
        "name": "5 star",
        "count": 10330
      }
    ]
  },
  {
    "image": "https://i.postimg.cc/7JS7McMX/image.png",
    "title": "ChatWave",
    "companyName": "TalkTech Solutions",
    "id": 9,
    "description": "ChatWave keeps you connected with seamless messaging, voice calls, and group chats — all in one beautifully designed app. Share photos, videos, and voice notes instantly with friends or teams. Enjoy secure conversations with end-to-end encryption and customizable privacy settings. ChatWave also offers smart notifications, emoji reactions, and chat themes to personalize your experience. Whether it’s work or fun, ChatWave makes communication fast, expressive, and reliable anytime, anywhere.",
    "size": 95,
    "reviews": 32450,
    "ratingAvg": 4.3,
    "downloads": "1.1M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1200
      },
      {
        "name": "2 star",
        "count": 1700
      },
      {
        "name": "3 star",
        "count": 5400
      },
      {
        "name": "4 star",
        "count": 8200
      },
      {
        "name": "5 star",
        "count": 16150
      }
    ]
  },
  {
    "image": "https://i.postimg.cc/9rJYfD1w/image.png",
    "title": "MealMaster",
    "companyName": "Foodie Apps Inc.",
    "id": 10,
    "description": "MealMaster simplifies healthy eating with personalized meal plans, nutrition tracking, and thousands of easy-to-cook recipes. Discover new dishes based on your dietary goals, allergies, or calorie limits. Create grocery lists automatically and monitor your daily intake to stay balanced. With smart meal suggestions and a vibrant food community, MealMaster turns nutrition into a fun and rewarding experience. Plan smarter, eat better, and live healthier — every meal made easy with MealMaster.",
    "size": 110,
    "reviews": 21430,
    "ratingAvg": 4.5,
    "downloads": "850K",
    "ratings": [
      {
        "name": "1 star",
        "count": 900
      },
      {
        "name": "2 star",
        "count": 1300
      },
      {
        "name": "3 star",
        "count": 4600
      },
      {
        "name": "4 star",
        "count": 6200
      },
      {
        "name": "5 star",
        "count": 8550
      }
    ]
  },
  {
    "image": "https://i.postimg.cc/mtttQhBM/image.png",
    "title": "MindSpace",
    "companyName": "Zen Labs",
    "id": 11,
    "description": "MindSpace helps you find calm and balance through guided meditations, breathing exercises, and relaxing soundscapes. Whether you’re managing stress, improving focus, or enhancing sleep, MindSpace adapts to your mental wellness goals. Explore daily mindfulness challenges, mood tracking, and expert sessions designed to boost positivity. With soothing visuals and offline access, you can practice peace anywhere. MindSpace isn’t just an app — it’s your sanctuary for a healthier, happier mind.",
    "size": 130,
    "reviews": 28900,
    "ratingAvg": 4.6,
    "downloads": "1.3M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1100
      },
      {
        "name": "2 star",
        "count": 1400
      },
      {
        "name": "3 star",
        "count": 5600
      },
      {
        "name": "4 star",
        "count": 7700
      },
      {
        "name": "5 star",
        "count": 13200
      }
    ]
  },
  {
    "image": "https://i.postimg.cc/K17FLyKw/image.png",
    "title": "FitTrack",
    "companyName": "HealthSync Co.",
    "id": 12,
    "description": "FitTrack empowers you to monitor every step of your health journey. Track workouts, calories, heart rate, and sleep patterns with detailed analytics. Get personalized training recommendations and goal-oriented challenges that keep you motivated daily. FitTrack seamlessly syncs with wearables and provides AI-based insights for faster results. Whether you're starting your fitness journey or perfecting your routine, FitTrack keeps you accountable and inspired. Achieve your best self — one workout at a time.",
    "size": 145,
    "reviews": 41000,
    "ratingAvg": 4.4,
    "downloads": "2.0M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1400
      },
      {
        "name": "2 star",
        "count": 2200
      },
      {
        "name": "3 star",
        "count": 7000
      },
      {
        "name": "4 star",
        "count": 12000
      },
      {
        "name": "5 star",
        "count": 17400
      }
    ]
  },
  {
    "image": "https://i.postimg.cc/5HkrQP3X/image.png",
    "title": "BudgetBuddy",
    "companyName": "FinanceFlow",
    "id": 13,
    "description": "BudgetBuddy helps you manage your finances smarter with clear insights and visual dashboards. Track expenses, set budgets, and analyze spending patterns effortlessly. Get smart alerts when you overspend and discover ways to save more every month. With secure data encryption, multi-account support, and auto-categorization, BudgetBuddy puts you in full control of your money. Whether for personal budgeting or business tracking, it’s your trusted financial companion that helps you stay on top of your goals.",
    "size": 100,
    "reviews": 19000,
    "ratingAvg": 4.1,
    "downloads": "780K",
    "ratings": [
      {
        "name": "1 star",
        "count": 800
      },
      {
        "name": "2 star",
        "count": 1100
      },
      {
        "name": "3 star",
        "count": 3500
      },
      {
        "name": "4 star",
        "count": 5800
      },
      {
        "name": "5 star",
        "count": 8700
      }
    ]
  },
  {
    "image": "https://i.postimg.cc/mPpjmPFm/image.png",
    "title": "PhotoCast",
    "companyName": "Visionary Media",
    "id": 14,
    "description": "PhotoCast lets you share life’s best moments through stunning photos and creative stories. Apply professional filters, edit instantly, and post with just one tap. Discover trending creators, follow friends, and join a global community that celebrates creativity. With advanced privacy controls, high-resolution uploads, and powerful editing tools, PhotoCast redefines how you express yourself visually. Whether for casual sharing or building a brand, PhotoCast makes every picture tell your story beautifully.",
    "size": 160,
    "reviews": 44500,
    "ratingAvg": 4.7,
    "downloads": "2.5M",
    "ratings": [
      {
        "name": "1 star",
        "count": 1800
      },
      {
        "name": "2 star",
        "count": 2100
      },
      {
        "name": "3 star",
        "count": 6400
      },
      {
        "name": "4 star",
        "count": 12100
      },
      {
        "name": "5 star",
        "count": 21600
      }
    ]
  },
  {
    "image": "https://i.postimg.cc/rD7n8dFW/image.png",
    "title": "NextPulse",
    "companyName": "Informed Media",
    "id": 15,
    "description": "NextPulse keeps you informed with the latest news, live updates, and trending stories from around the world. Customize your feed by choosing topics that matter most — from politics to tech, entertainment, and sports. The AI-powered recommendation engine curates high-quality content tailored to your interests. Enjoy offline reading, breaking news alerts, and a clean, ad-free experience. With NextPulse, staying updated has never been smarter or easier.",
    "size": 90,
    "reviews": 23000,
    "ratingAvg": 4.2,
    "downloads": "900K",
    "ratings": [
      {
        "name": "1 star",
        "count": 1200
      },
      {
        "name": "2 star",
        "count": 1500
      },
      {
        "name": "3 star",
        "count": 3100
      },
      {
        "name": "4 star",
        "count": 7200
      },
      {
        "name": "5 star",
        "count": 11000
      }
    ]
  },
  {
    "image": "https://i.postimg.cc/d76KDm7g/image.png",
    "title": "EcoTrack",
    "companyName": "GreenVision Labs",
    "id": 16,
    "description": "EcoTrack empowers you to live sustainably by tracking your carbon footprint and suggesting eco-friendly lifestyle changes. Measure your energy use, transportation impact, and consumption habits to make smarter, greener choices. Join community challenges, earn eco-points, and see your positive impact grow over time. Whether you're an environmental enthusiast or just starting your green journey, EcoTrack makes sustainability easy, inspiring, and rewarding. Small actions — big difference.",
    "size": 85,
    "reviews": 16800,
    "ratingAvg": 4.5,
    "downloads": "650K",
    "ratings": [
      {
        "name": "1 star",
        "count": 700
      },
      {
        "name": "2 star",
        "count": 900
      },
      {
        "name": "3 star",
        "count": 2300
      },
      {
        "name": "4 star",
        "count": 5200
      },
      {
        "name": "5 star",
        "count": 7700
      }
    ]
  }
]